{
	"header": {
		"name": "Stéfano Damiano",
		"description": "Desenvolvedor Front-End",
		"items": [
			{
				"name": "Phone",
				"text": "11 97027-9708"
			},
			{
				"name": "Nasc",
				"text": "08/08/1989"
			},
			{
				"name": "Cidade",
				"text": "São Paulo - SP"
            },
            {
				"name": "Email",
				"text": "mineiro.guaxupe@gmail.com"
			}
		]
    },
    "xperience": {
        "items": [
            {
                "company": "- Dafiti",
                "duration": "De: Fev/2019 até Hoje",
                "position": "Cargo: Desenvolvedor Front-End Sênior",
                "description": "Descrição: Participo desde o início da renovação do e-commerce como um todo, projeto cuja a intenção é substituir a plataforma legada por uma plataforma moderna e escalável seguindo as premissas de PWA",
                "highlights": [                    
                    "- Tive a oportunidade de participar das decisões de arquitetura da nova plataforma, escolhendo a nova stack baseado nas necessidades do produto. Acabamos escolhendo uma stack de React com SSR e Graphql para o front end. Uma arquitetura de API Gateway e micro serviços no backend utilizando Golang e nodeJS com typescript trazendo também uma cultura de teste end to end, unitários com alta cobertura e CI/CD.",
                    "- Aprendi muito a respeito de mentoria de desenvolvedores menos experientes e a difundir conhecimento sobre padrões e boas práticas de desenvolvimento, ao mesmo tempo que aprendo com eles, para que a qualidade e as idéias iniciais de um projeto de renovação como esse não se perdessem ao longo de tempo.",
                    "- Apesar de ser especializado em front-end, atuei muito no backend da plataforma, especialmente nos pontos de comunicação entre micro serviços e API Gateway (BFF), também tive muito contato com a equipe de infraestrutura aumentando meus conhecimentos sobre as ferramentas utilizadas, como RabbitMQ, Kubernetes e plataformas como Akamai.",
                    "- A alta performance do site sempre foi uma premissa nesse projeto, e tive a oportunidade de aprender muito sobre como conseguir atingir e manter a performance de um e-commerce, e todas as dificuldades técnicas e interpessoais que isso pode envolver.",
                    "- Fui capaz de manter bom contato com pessoas de outras áreas como marketing e negócios, abrindo mais a mente para perceber as necessidades da empresa como um todo e poder tomar decisões técnicas de maneira mais inteligente com essas informações em mãos."
                ]
            },
            {
                "company": "- TOTVS (idexo)",
                "duration": "De: Jan/2018 até Fev/2019",
                "position": "Cargo: Desenvolvedor Front-End Sênior",
                "description": "Descrição: Criação e manutenção de um e-commerce capaz de se adequar a regras de negócio complexas de produtos da empresa",
                "highlights": [                    
                    "- Ambiente de inovação com intenção de renovar a cultura da velha TOTVS. Trabalhamos lado a lado com start-ups incubadas pela TOTVS, o que permite agregar muito sobre tecnologias e soluções quentes.",
                    "- Tivemos a oportunidade de começar tudo do zero, portanto escolhemos a stack, que é: React com styled-components, styled-system, fazendo uso de context API, Graphql com Relay modern, Node (express) e MQTT (para mensagem entre micro-serviços).",
                    "- Criação de uma arquitetura de execução de regras de negócio no front-end que não são fixas no mesmo. Usamos uma estrutura declarativa com https://github.com/jwadhams/json-logic-js que permite que as regras sejam geradas pelo back-end e apenas consumidas e executadas pelo front (evitando um oceano de condições no front)."
                ]
            },
            {
                "company": "- Universo Online (UOL)",
                "duration": "De: Jul/2012 até Dez/2017",
                "position": "Cargo: Desenvolvedor Front-End Pleno",
                "description": "Descrição: Criação e manutenção de páginas do portal (layout, integrações com back-end e sistemas externos), criação e manutenção de sistemas internos (principalmente em node), criação de serviços",
                "highlights": [                    
                    "- Passei por diversas areas de desenvolvimento da empresa, ganhando bom conhecimento das dificuldades e desafios de colocar e manter um portal com milhões de acessos em produção.",
                    "- Passei pelas dificuldades de se criar layouts responsivos cross-browser que precisam rodar em navegadores antigos.",
                    "- Desenvolvi integrações com ferramentas experimentais do google e facebook. Como o UOL tinha parceria com essas empresas, e era um bom laboratório pela quantidade de acessos, eles liberavam algumas ferramentas novas antes do lançamento. Ferramentas como AMP, Instant Articles e Facebook Messenger BOTS.",
                    "- Aprendi muito sobre arquitetura de back-end trabalhando na criação do micro-serviço do Facebook Messenger BOT, pelo fato de ser necessário fazer envio de milhões de mensagens (quando aparecia alguma notícia bombástica), aprendi muito sobre como escalar uma aplicação node, kubernetes, sobre uso de filas (rabbitmq principalmente) e banco de dados não relacional (mongodb)."
                ]
            },
            {
                "company": "- KAITS - Sistema educacional",
                "duration": "De: Fev/2011 até Jan/2012",
                "position": "Cargo: Estagiário",
                "description": "Descrição: Atuação com javascript vanilla na construção e manutenção de um sistema web para escolas de idioma",
                "highlights": [                    
                    "-Uso de javascript sem nenhum framework foi uma experiência interessante, principalmente por estar começando a usar js na época."                      
                ]
            }
        ]
    },
    "skills": [
        "Javascript",
        "ES20XX",
        "HTML5",
        "CSS3",
        "React",
        "SSR",
        "Graphql",
        "Relay",
        "Apollo",
        "Unity Test",
        "Jest",
        "Enzyme",
        "React-testing-library",
        "Nightwatch",
        "Linux",
        "GIT",
        "Docker",
        "Node",
        "Mongodb",
        "Rabbitmq",
        "Kubernetes",
        "SCRUM",
        "Kanban"
    ],
    "education": {
        "items": [
            {
                "name": "Universidade Presbiteriana Mackenzie",
                "type": "Bacharel em Ciência da Computação",
                "duration": "2008 - 2012"
            }
        ]
    },
    "languages": {
        "items": [
            {
                "name": "Português",
                "level": "Nativo"
            },
            {
                "name": "Inglês",
                "level": "Intermediário"
            },
            {
                "name": "Espanhol",
                "level": "Básico"
            }
        ]
    }
}
